sdaiCreateNestedAggrByItr(Sdai_ItrId*)
\details
Creates an aggregate instance that replaces the current member of an aggregate instance referenced by a specified iterator.
\param current [in]  An iterator that refers to the current member of the aggregate.
\returns The identifier of the newly created aggregate instance.